# GetVersionHistory Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationPart..::..GetVersionHistory Method
FabricationPart Class See Also
---
Gets a history of version change information about the current part.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2019
# Syntax
C#
---
```text
public IList<FabricationVersionInfo> GetVersionHistory()
```

Visual Basic
---
```text
Public Function GetVersionHistory As IList(Of FabricationVersionInfo)
```

Visual C++
---
```text
public:
IList<FabricationVersionInfo^>^ GetVersionHistory()
```

# ### Return Value
A list of version information about the current part. The list starts with the most recent changes.
# See Also
FabricationPart Class
Autodesk.Revit.DB Namespace